# CLI essentials
brew "git"
brew "git-lfs"
brew "fnm"
brew "asdf" # Version manager for multiple runtimes 
brew "jq"
brew "wget"
brew "ripgrep"
brew "mas"

# CLI Basics
brew 'most'         # Multi-window scroll pager (better less)
brew 'procs'        # Advanced process viewer (better ps)
brew 'tokei'        # Count lines of code (better cloc)
brew 'tree'         # Directory listings as tree structure
brew 'trash-cli'    # Record and restore removed files
brew 'watch'        # Run commands periorically

# CLI Monitoring and Performance Apps
brew 'bmon'         # Bandwidth utilization monitor 
brew 'ctop'         # Container metrics and monitoring
brew 'bpytop'       # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'glances'      # Resource monitor + web and API
brew 'goaccess'     # Web log analyzer and viewer
brew 'gping'        # Interactive ping tool, with graph
brew 'speedtest-cli'# Command line speed test utility

# CLI Productivity Apps
brew 'aspell'       # Spell check
brew 'buku'         # Bookmark manager
brew 'cmus'         # Music player
brew 'cointop'      # Crypto prices and portfolio
brew 'ddgr'         # Web search, via DuckDuckGo
brew 'khal'         # Calendar client
brew 'mutt'         # Email client
brew 'newsboat'     # RSS / ATOM reader
brew 'pass'         # Password store
brew 'rclone'       # Manage cloud storage
brew 'task'         # Todo + task management

# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client
brew 'lazydocker'   # Full Docker management app
brew 'lazygit'      # Full Git management app

# CLI External Sercvices
cask 'ngrok'        # Reverse proxy for sharing localhost
brew 'tmate'        # Share a terminal session via internet
brew 'asciinema'    # Recording + sharing terminal sessions
brew 'navi'         # Browse, search, read cheat sheets
brew 'agg'          # AI-powered CLI for searching and summarizing docs
brew 'ffmpeg'       # Audio and video processing tools

# Multi Terminal (tutti cask disponibili)
cask "iterm2"
cask "wezterm"
cask "kitty"
cask "ghostty"
cask "cmux"
brew "tmux"

# Developer Tools
brew "awscli"         
brew "vercel-cli" 
cask 'boop'           # Text transformation tool
cask "postman"
cask 'sourcetree'     # Git visual client
cask "docker-desktop"
cask "visual-studio-code"
cask "google-chrome"
cask "github"
cask "antigravity"
brew "gemini-cli"
brew "opencode"
cask "opencode-desktop"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "zed"
cask "ollama-app"
brew "agent-browser"

# Development Utils
brew 'gh'             # Interact with GitHub PRs, issues, repos
brew "pnpm"
brew 'git-extras'     # Extra git commands for common tasks
brew 'scrcpy'         # Display and control Android devices
brew 'terminal-notifier' # Trigger Mac notifications from terminal
brew 'tig'            # Text-mode interface for git
brew 'ttygif'         # Generate GIF from terminal commands + output
brew 'watchman'       # Watch for changes and reload dev server

# Network and Security Testing
brew 'bettercap'      # Network, scanning and monitoring
brew 'nmap'           # Port scanning
brew 'wrk'            # HTTP benchmarking
cask 'burp-suite'     # Web security testing
cask 'zap'      # Web app security scanner
cask 'wireshark-app'      # Network analyzer + packet capture

# Security Utilities and Data Encryption
brew 'bcrypt'         # Encryption utility, using blowfish
brew 'borgbackup'     # Encrypted, deduplicated backups
#brew 'clamav'         # Open source virus scanning suite
brew 'dnscrypt-proxy' # Proxy for using encrypted DNS
brew 'lynis'          # Scan system for common security issues
brew 'openssl'        # Cryptography and SSL/TLS Toolkit
brew 'rkhunter'       # Search / detect potential root kits
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"


# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
cask "claude"
cask "claude-code"
#mas "Perplexity", id: 6714467650
cask "slack"
cask "zoom"
cask "dropbox"


#############################################################
# Desktop Applications                                      #
#############################################################

# Creativity
cask 'audacity'     # Audio editor / recorder
cask 'gimp'         # Photo editor
brew 'handbrake'    # Video transcoder
cask 'inkscape'     # Vector editor
cask 'obs'          # Screencasting / recording
cask 'shotcut'      # Video editor

# Media
cask 'calibre'      # E-Book reader
cask 'spotify', args: { require_sha: false } # Propietary music streaming
cask 'transmission' # Torrent client
cask 'vlc'          # Media player
brew 'pandoc'       # Universal file converter

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'

# Mac OS Quick-Look Plugins
cask 'qlcolorcode'    # QL for code with highlighting
cask 'qlmarkdown'     # QL for markdown files
cask 'qlprettypatch'  # QL for patch / diff files
cask 'qlstephen'      # QL for dev text files
cask 'qlvideo'        # QL for video formats
cask 'quicklook-csv'  # QL for tables in CSV format
cask 'webpquicklook',  args: { require_sha: false } # QL for WebP image files

# Mac OS Mods and Imrovments
cask 'alt-tab'        # Much better alt-tab window switcher
cask 'anybar'         # Custom programmatic menubar icons
cask 'copyq'          # Clipboard manager (cross platform)
cask 'espanso'        # Live text expander (cross-platform)
cask 'finicky'        # Website-specific default browser
cask 'hiddenbar'      # Hide / show annoying menubar icons
brew 'iproute2mac'    # MacOS port of netstat and ifconfig
brew 'm-cli'          # All in one MacOS management CLI app
cask 'mjolnir'        # Util for loading Lua automations
cask 'openinterminal' # Finder button, opens directory in terminal
cask 'raycast', args: { require_sha: false }  # Spotlight alternative
cask 'shottr'         # Better screenshot utility
cask 'stats'          # System resource usage in menubar

# Mac OS Utility Apps
cask 'coteditor'      # Just a simple plain-text editor
cask 'little-snitch'  # Firewall app viewing / blocking traffic
cask 'keka'           # File archiver and extractor


##useful commands
#brew update && brew upgrade && brew cleanup

#brew bundle cleanup #remove software no longer in your Brewfile